## Grouping data by groupby()

In [1]:
import pandas as pd
import numpy as np

In [45]:
df1 = pd.DataFrame({'X':[3,5,2,6,4]}, index=['a','b','a','b','a'])
df1

   X
a  3
b  5
a  2
b  6
a  4

In [27]:
g = df1.groupby(df1.index)

In [24]:
for t in g:
    print(t[0])
    print(t[1])

a
   X
a  3
a  2
a  4
b
   X
b  5
b  6

After grouping the data, you can either set it up as a list list() or a dictionary dict()

In [35]:
list(g)

[('a',    X
  a  3
  a  2
  a  4), ('b',    X
  b  5
  b  6)]

In [36]:
d = dict(list(g))

In [53]:
d['a']

   X
a  3
a  2
a  4

In [54]:
g = df1.groupby(df1.index)
g.sum()

    X
a   9
b  11

In [3]:
df = pd.DataFrame({'key1': ['a','a','b','b','a'],
                   'key2': ['one','two','one','two','one'],
                   'data1': np.random.rand(5),
                   'data2': np.random.rand(5)})
df

  key1 key2     data1     data2
0    a  one  0.050863  0.300557
1    a  two  0.739086  0.144377
2    b  one  0.258855  0.519407
3    b  two  0.584384  0.688082
4    a  one  0.175625  0.321989

In [14]:
g = df['data1'].groupby(df['key1'])
g.mean()

key1
a    0.321858
b    0.421619
Name: data1, dtype: float64